#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
tls_private_key.cloud_key: Refreshing state... [id=7500f84e5c6aaee819950c3abf7bbeb89cd7ee1d]
data.aws_ami.ubuntu: Reading...
aws_key_pair.cloud_key: Refreshing state... [id=cloud_key]
data.aws_ami.rhel: Reading...
aws_vpc.aap_vpc: Refreshing state... [id=vpc-0e59ff85bcef9d0f7]
data.aws_ami.ubuntu: Read complete after 0s [id=ami-07e7b4e1174e7d3ba]
data.aws_ami.rhel: Read complete after 1s [id=ami-0f7504305008843ad]
aws_internet_gateway.aap_igw: Refreshing state... [id=igw-07a2a93339c27f7a2]
aws_security_group.mqtt_sg: Refreshing state... [id=sg-01b5d60279b5c272a]
aws_subnet.aap_subnet: Refreshing state... [id=subnet-0ea5fccce7ce645bf]
aws_security_group.aap_security_group: Refreshing state... [id=sg-004d1a38a9917c945]
aws_route_table.aap_pub_igw: Refreshing state... [id=rtb-069bcc3d3ed004fde]
aws_security_group_rule.mqtt_egress_access: Refreshing state... [id=sgrule-2754326783]
aws_security_group_rule.mqtt_ssh_access: Refreshing state... [id=sgrule-2746981483]
aws_security_group_rule.mqtt_ingress_access: Refreshing state... [id=sgrule-1234954325]
aws_security_group_rule.egress_access: Refreshing state... [id=sgrule-1050871622]
aws_security_group_rule.http_ingress_access: Refreshing state... [id=sgrule-1343214712]
aws_security_group_rule.https_ingress_access: Refreshing state... [id=sgrule-3229341646]
aws_security_group_rule.grpc_ingress_access: Refreshing state... [id=sgrule-2202519959]
aws_security_group_rule.postgresql_ingress_access: Refreshing state... [id=sgrule-3636522058]
aws_security_group_rule.redis_ingress_access: Refreshing state... [id=sgrule-3653686692]
aws_security_group_rule.secure_ingress_access: Refreshing state... [id=sgrule-2498354451]
aws_security_group_rule.ssh_ingress_access: Refreshing state... [id=sgrule-3867511245]
aws_route_table_association.aap_rt_subnet_public: Refreshing state... [id=rtbassoc-01ff4e644565a3a60]
aws_instance.aap_instance: Refreshing state... [id=i-0ffce616d8eb4d059]
aws_instance.mqtt_broker: Refreshing state... [id=i-0b577bf4d1adff22d]
null_resource.mqtt_instance_setup: Refreshing state... [id=8598362761143734856]
ansible_host.mqtt_broker[0]: Refreshing state... [id=ec2-3-141-41-78.us-east-2.compute.amazonaws.com]
ansible_host.mqtt_broker[1]: Refreshing state... [id=ec2-3-141-41-78.us-east-2.compute.amazonaws.com]
null_resource.aap_instance_setup: Refreshing state... [id=8212354255894831767]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_instance.aap_instance must be replaced
-/+ resource "aws_instance" "aap_instance" {
      ~ ami                                  = "ami-00267e8bc4a50773c" -> "ami-0f7504305008843ad" # forces replacement
      ~ arn                                  = "arn:aws:ec2:us-east-2:356109667979:instance/i-0ffce616d8eb4d059" -> (known after apply)
      ~ cpu_core_count                       = 2 -> (known after apply)
      ~ cpu_threads_per_core                 = 2 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-0ffce616d8eb4d059" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-0e83efb28c07e9def" -> (known after apply)
      ~ private_dns                          = "ip-10-1-0-99.us-east-2.compute.internal" -> (known after apply)
      ~ private_ip                           = "10.1.0.99" -> (known after apply)
      ~ public_dns                           = "ec2-3-139-67-59.us-east-2.compute.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "3.139.67.59" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
        tags                                 = {
            "Name"      = "aap_instance"
            "Terraform" = "true"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data_base64                     = (known after apply)
        # (11 unchanged attributes hidden)

      ~ capacity_reservation_specification {
          ~ capacity_reservation_preference = "open" -> (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      ~ cpu_options {
          + amd_sev_snp      = (known after apply)
          ~ core_count       = 2 -> (known after apply)
          ~ threads_per_core = 2 -> (known after apply)
        }

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ maintenance_options {
          ~ auto_recovery = "default" -> (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ private_dns_name_options {
          ~ enable_resource_name_dns_a_record    = false -> (known after apply)
          ~ enable_resource_name_dns_aaaa_record = false -> (known after apply)
          ~ hostname_type                        = "ip-name" -> (known after apply)
        }

      ~ root_block_device {
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 3000 -> (known after apply)
          + kms_key_id            = (known after apply)
          - tags                  = {} -> null
          ~ throughput            = 125 -> (known after apply)
          ~ volume_id             = "vol-0f3089f1e1425c543" -> (known after apply)
            # (3 unchanged attributes hidden)
        }
    }

  # null_resource.aap_instance_setup is tainted, so must be replaced
-/+ resource "null_resource" "aap_instance_setup" {
      ~ id = "8212354255894831767" -> (known after apply)
    }

  # null_resource.mqtt_instance_setup is tainted, so must be replaced
-/+ resource "null_resource" "mqtt_instance_setup" {
      ~ id = "8598362761143734856" -> (known after apply)
    }

Plan: 3 to add, 0 to change, 3 to destroy.

Changes to Outputs:
  ~ instance_id = "i-0ffce616d8eb4d059" -> (known after apply)
  ~ public_fqdn = "ec2-3-139-67-59.us-east-2.compute.amazonaws.com" -> (known after apply)
  ~ public_ip   = "3.139.67.59" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @r3dact3d, Action: `pull_request`*